10 REM MAZE
20 DIM A$(19,31)
30 LET A$(1)="███████████████████████████████"
40 LET A$(2)="█ █     █ █     █       █     █"
50 LET A$(3)="█ ███ █ █ █ █ ███ ███ ███ █ █ █"
60 LET A$(4)="█ █   █ █   █       █ █   █ █ █"
70 LET A$(5)="█ █ ███ █████████████ █ ███ ███"
80 LET A$(6)="█ █   █         █   █ █ █ █   █"
90 LET A$(7)="█ ███ █████████ █ █ █ █ █ ███ █"
100 LET A$(8)="█   █     █   █   █ █     █   █"
110 LET A$(9)="███ █ ███ █ ███████ ███████ █ █"
120 LET A$(10)="█   █ █   █ █       █   █   █ █"
130 LET A$(11)="█ ███ █ ███ █ ███████ █ █ ███ █"
140 LET A$(12)="█ █ █ █ █   █ █       █ █ █ █ █"
150 LET A$(13)="█ █ █ █ ███ █ ███ █████ █ █ █ █"
160 LET A$(14)="█ █   █   █   █   █   █   █   █"
170 LET A$(15)="█ █ █████ █ ███ ███ █ █████ ███"
180 LET A$(16)="█ █     █ █ █   █ █ █   █   █ █"
190 LET A$(17)="█ ███████ █ ███ █ █ ███ █ ███ █"
200 LET A$(18)="█         █     █     █       E"
210 LET A$(19)="███████████████████████████████"
220 CLS
230 FOR I=1 TO 19
240 PRINT AT I-1,0;A$(I)
250 NEXT I
260 PRINT AT 20,0;"REACH E TO WIN"
270 PRINT AT 21,0;"Z X K M TO MOVE"
280 LET Y=2
290 LET X=2
300 PRINT AT Y-1,X-1;"O"
310 LET K$=INKEY$
320 IF K$="" THEN GOTO 310
330 LET U=Y
340 LET V=X
350 IF K$="Z" THEN LET V=X-1
360 IF K$="X" THEN LET V=X+1
370 IF K$="K" THEN LET U=Y-1
380 IF K$="M" THEN LET U=Y+1
390 IF A$(U,V)="█" THEN GOTO 310
400 PRINT AT Y-1,X-1;" "
410 LET Y=U
420 LET X=V
430 PRINT AT Y-1,X-1;"O"
440 IF A$(Y,X)="E" THEN GOTO 460
450 GOTO 310
460 PRINT AT 20,0;"YOU ESCAPED   "
470 PAUSE 300
480 RUN
