10 REM MAZE
20 CLS
30 PRINT AT 5,14;"MAZE"
40 PRINT AT 10,9;"PRESS ANY KEY"
50 IF INKEY$="" THEN GOTO 50
60 DIM A$(19,31)
70 LET A$(1)="███████████████████████████████"
80 LET A$(2)="█ █     █ █     █       █     █"
90 LET A$(3)="█ ███ █ █ █ █ ███ ███ ███ █ █ █"
100 LET A$(4)="█ █   █ █   █       █ █   █ █ █"
110 LET A$(5)="█ █ ███ █████████████ █ ███ ███"
120 LET A$(6)="█ █   █         █   █ █ █ █   █"
130 LET A$(7)="█ ███ █████████ █ █ █ █ █ ███ █"
140 LET A$(8)="█   █     █   █   █ █     █   █"
150 LET A$(9)="███ █ ███ █ ███████ ███████ █ █"
160 LET A$(10)="█   █ █   █ █       █   █   █ █"
170 LET A$(11)="█ ███ █ ███ █ ███████ █ █ ███ █"
180 LET A$(12)="█ █ █ █ █   █ █       █ █ █ █ █"
190 LET A$(13)="█ █ █ █ ███ █ ███ █████ █ █ █ █"
200 LET A$(14)="█ █   █   █   █   █   █   █   █"
210 LET A$(15)="█ █ █████ █ ███ ███ █ █████ ███"
220 LET A$(16)="█ █     █ █ █   █ █ █   █   █ █"
230 LET A$(17)="█ ███████ █ ███ █ █ ███ █ ███ █"
240 LET A$(18)="█         █     █     █       E"
250 LET A$(19)="███████████████████████████████"
260 CLS
270 FOR I=1 TO 19
280 PRINT AT I-1,0;A$(I)
290 NEXT I
300 PRINT AT 20,0;"REACH E TO WIN"
310 PRINT AT 21,0;"5 6 7 8 TO MOVE"
320 LET Y=2
330 LET X=2
340 PRINT AT Y-1,X-1;"O"
345 REM WAIT FOR KEY
350 LET K$=INKEY$
360 IF K$="" THEN GOTO 350
370 LET U=Y
380 LET V=X
390 IF K$="5" THEN LET V=X-1
400 IF K$="8" THEN LET V=X+1
410 IF K$="7" THEN LET U=Y-1
420 IF K$="6" THEN LET U=Y+1
430 IF A$(U,V)="█" THEN GOTO 350
440 PRINT AT Y-1,X-1;" "
450 LET Y=U
460 LET X=V
470 PRINT AT Y-1,X-1;"O"
480 IF A$(Y,X)="E" THEN GOTO 500
490 GOTO 350
495 REM WIN SCREEN
500 PRINT AT 20,0;"YOU ESCAPED   "
510 PAUSE 300
