10 REM MAZE
20 BORDER 0: PAPER 0: INK 7: CLS
30 DIM a$(19,31)
40 LET a$(1)="███████████████████████████████"
50 LET a$(2)="█ █     █ █     █       █     █"
60 LET a$(3)="█ ███ █ █ █ █ ███ ███ ███ █ █ █"
70 LET a$(4)="█ █   █ █   █       █ █   █ █ █"
80 LET a$(5)="█ █ ███ █████████████ █ ███ ███"
90 LET a$(6)="█ █   █         █   █ █ █ █   █"
100 LET a$(7)="█ ███ █████████ █ █ █ █ █ ███ █"
110 LET a$(8)="█   █     █   █   █ █     █   █"
120 LET a$(9)="███ █ ███ █ ███████ ███████ █ █"
130 LET a$(10)="█   █ █   █ █       █   █   █ █"
140 LET a$(11)="█ ███ █ ███ █ ███████ █ █ ███ █"
150 LET a$(12)="█ █ █ █ █   █ █       █ █ █ █ █"
160 LET a$(13)="█ █ █ █ ███ █ ███ █████ █ █ █ █"
170 LET a$(14)="█ █   █   █   █   █   █   █   █"
180 LET a$(15)="█ █ █████ █ ███ ███ █ █████ ███"
190 LET a$(16)="█ █     █ █ █   █ █ █   █   █ █"
200 LET a$(17)="█ ███████ █ ███ █ █ ███ █ ███ █"
210 LET a$(18)="█         █     █     █       E"
220 LET a$(19)="███████████████████████████████"
230 FOR i=1 TO 19: PRINT AT i-1,0; INK 4;a$(i): NEXT i
240 PRINT AT 17,30; INK 6; FLASH 1;"E"
250 PRINT AT 20,0;"REACH E TO WIN"
260 PRINT AT 21,0;"q a o p to move"
270 LET y=2: LET x=2
280 PRINT AT y-1,x-1; INK 6;"O"
285 REM WAIT FOR KEY
290 LET k$=INKEY$
300 IF k$="" THEN GO TO 290
310 LET u=y: LET v=x
320 IF k$="o" OR k$="O" THEN LET v=x-1
330 IF k$="p" OR k$="P" THEN LET v=x+1
340 IF k$="q" OR k$="Q" THEN LET u=y-1
350 IF k$="a" OR k$="A" THEN LET u=y+1
360 IF a$(u,v)="█" THEN GO TO 290
370 PRINT AT y-1,x-1;" "
380 LET y=u: LET x=v
390 PRINT AT y-1,x-1; INK 6;"O"
400 IF a$(y,x)<>"E" THEN GO TO 290
410 PRINT AT 20,0; FLASH 1;"YOU ESCAPED!  "
420 PAUSE 300
